Makro/Pruebas/Prueba 15.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|01|F|SETT|4001140|2022-03-23|15:28:00|COP||1|31|900059238|MAKRO|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|2|13|1067852713|SANDRA MILENA ESQUIVEL GOMEZ|SANDRA MILENA ESQUIVEL GOMEZ||||||MONTERIA|CL 3C 20 41|CO|49|1028414.89|884714.89|1099283.00|0.00|0.00|0.00|1099283.00
ENEX|UBL 2.1|10|||||||2022-02-10||15:28:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|CORDOBA|23|Cra.  14  No.  48 A 42 |CO|Colombia||13|||23001|MONTERIA|CORDOBA|23|CL 3C 20 41|CO|Colombia||13|24|16FD|01552666|23|Colombia|23001|CORDOBA|Colombia|23|111711|111711
RS|2019-01-19|2030-01-19|SETT|1|50000000||18760000001
DE|1|112763|C62|3.00|28151.26|74319.33||0.00||false
DEDI|ACEITE OLIVA ANDALUZ EX-VIRGEN 1l
DEDI|88440.00
DEDIEX||999|1|||
DEIM|14120.67|74319.33|14120.67|19.00|01|IVA||C62|4706.89
DEDR|false|10134.45|12.00|||84453.78
DE|2|345904|C62|2.00|9579.83|18393.27||0.00||false
DEDI|AJI PEPITA PICANTE FCO 1000g 
DEDI|21888.00
DEDIEX||999|1|||
DEIM|3494.72|18393.27|3494.72|19.00|01|IVA||C62|1747.36
DEDR|false|766.39|4.00|||19159.66
DE|3|676624|C62|3.00|9700.00|29100.00||0.00||false
DEDI|CHAMPINON SETAS ENTERO BJA 500g
DEDI|29100.00
DEDIEX||999|1|||
DE|4|500851|C62|1.71|39649.88|67722.00||0.00||false
DEDI|PUNTA ANCA PUNTA GORDA TERNEZ kg
DEDI|67722.00
DEDIEX||999|1|||
DEIM|0.00|67722.00|0.00|0.00|01|IVA||C62|0.00
DE|5|500851|C62|1.60|39650.00|63440.00||0.00||false
DEDI|PUNTA ANCA PUNTA GORDA TERNEZ kg
DEDI|63440.00
DEDIEX||999|1|||
DEIM|0.00|63440.00|0.00|0.00|01|IVA||C62|0.00
DE|6|500630|C62|1.58|50200.00|79316.00||0.00||false
DEDI|LOMO FINO RES TERNEZ kg
DEDI|79316.00
DEDIEX||999|1|||
DEIM|0.00|79316.00|0.00|0.00|01|IVA||C62|0.00
DE|7|500851|C62|1.76|39650.17|69705.00||0.00||false
DEDI|PUNTA ANCA PUNTA GORDA TERNEZ kg
DEDI|69705.00
DEDIEX||999|1|||
DEIM|0.00|69705.00|0.00|0.00|01|IVA||C62|0.00
DE|8|500851|C62|1.79|39649.89|70894.00||0.00||false
DEDI|PUNTA ANCA PUNTA GORDA TERNEZ kg
DEDI|70894.00
DEDIEX||999|1|||
DEIM|0.00|70894.00|0.00|0.00|01|IVA||C62|0.00
DE|9|698711|PA|3.00|12436.97|37310.92||0.00||false
DEDI|PAPA FRANCESA MCCAIN 13X13 2kg
DEDI|44400.00
DEDIEX||999|1|||
DEIM|7089.07|37310.92|7089.07|19.00|01|IVA||PA|2363.02
DE|10|135909|C62|2.00|57300.00|114600.00||0.00||false
DEDI|QSO MZRELA BLOQU COOLECHERA 2.5Kg
DEDI|114600.00
DEDIEX||999|1|||
DE|11|591032|GRM|1.00|15336.13|15336.13||0.00||false
DEDI|SALCHICHA RANCHERA SUPER 525gEN7u
DEDI|18250.00
DEDIEX||999|1|||
DEIM|2913.86|15336.13|2913.86|19.00|01|IVA||GRM|2913.86
DE|12|752271|PA|1.00|8151.26|8151.26||0.00||false
DEDI|CROQUETA YUCA MCCAIN JUMBO 1Kg
DEDI|9700.00
DEDIEX||999|1|||
DEIM|1548.74|8151.26|1548.74|19.00|01|IVA||PA|1548.74
DE|13|114649|BG|2.00|17226.89|34453.78||0.00||false
DEDI|DELIPACK SUSHI ARO GRANDE 10u
DEDI|41000.00
DEDIEX||999|1|||
DEIM|6546.22|34453.78|6546.22|19.00|01|IVA||BG|3273.11
DE|14|118380|C62|1.00|32773.11|32773.11||0.00||false
DEDI|QSO TIPO PARM CENTURION RALL 900g
DEDI|39000.00
DEDIEX||999|1|||
DEIM|6226.89|32773.11|6226.89|19.00|01|IVA||C62|6226.89
DE|15|28602|C62|1.00|5300.00|5300.00||0.00||false
DEDI|PAN BIMBO ARTESANO MESA 390gEN6u
DEDI|5300.00
DEDIEX||999|1|||
DEIM|0.00|5300.00|0.00|0.00|01|IVA||C62|0.00
DE|16|122402|C62|1.00|39411.76|39411.76||0.00||false
DEDI|MARGARINA RAMA PROFES BALDE 4kg
DEDI|46900.00
DEDIEX||999|1|||
DEIM|7488.23|39411.76|7488.23|19.00|01|IVA||C62|7488.23
DE|17|509730|PA|3.00|29327.73|87983.19||0.00||false
DEDI|CHORIZO SANT MONTEFRIO1.25kgEN20u
DEDI|104700.00
DEDIEX||999|1|||
DEIM|16716.81|87983.19|16716.81|19.00|01|IVA||PA|5572.27
DE|18|267514|C62|2.61|13250.19|34530.00||0.00||false
DEDI|PECHUGA PLL PIMPOLLO GRANEL kg
DEDI|34530.00
DEDIEX||999|1|||
DEIM|0.00|34530.00|0.00|0.00|01|IVA||C62|0.00
DE|19|267514|C62|2.47|13250.20|32728.00||0.00||false
DEDI|PECHUGA PLL PIMPOLLO GRANEL kg
DEDI|32728.00
DEDIEX||999|1|||
DEIM|0.00|32728.00|0.00|0.00|01|IVA||C62|0.00
DE|20|103671|CH|1.90|12600.21|23890.00||0.00||false
DEDI|PECHUGA C-P MARINADA BJA REFRIG
DEDI|23890.00
DEDIEX||999|1|||
DEIM|0.00|23890.00|0.00|0.00|01|IVA||CH|0.00
DE|21|108881|BG|2.00|9663.86|18554.62||0.00||false
DEDI|CABANO VILASECA 125g
DEDI|22080.00
DEDIEX||999|1|||
DEIM|3525.38|18554.62|3525.38|19.00|01|IVA||BG|1762.69
DEDR|false|773.11|4.00|||19327.73
DE|22|821483|BG|4.00|11300.00|40400.00||0.00||false
DEDI|CREMA LECHE ALQUERIA BOL 900g
DEDI|40400.00
DEDIEX||999|1|||
DEIM|0.00|40400.00|0.00|0.00|01|IVA||BG|0.00
DEDR|false|4800.00|10.62|||45200.00
DE|23|123601|CH|1.00|23800.00|23800.00||0.00||false
DEDI|LCH ENTER COLANTA UHT 1000mlx6u
DEDI|23800.00
DEDIEX||999|1|||
DEIM|0.00|23800.00|0.00|0.00|01|IVA||CH|0.00
DE|24|104617|BG|1.00|6302.52|6302.52||0.00||false
DEDI|B B ARO SUPERIND BIO
DEDI|7500.00
DEDIEX||999|1|||
DEIM|1197.48|6302.52|1197.48|19.00|01|IVA||BG|1197.48
DIT|70867.95
DI||511725.00|0.00|0.00|01|0.00|IVA||
DI||372990.05|70867.95|19.00|01|70867.95|IVA||
FP|1|49|2022-02-10|2216017569842
PE|Plantilla|T01_MBS.jasper
PE|CodigoBarras|220411281532010380102
PE|PPLTienda|ST16
PE|PPLCaja|1
PE|prom|0
PE|zona|N/A
PE|idInterno|1 2022041128
PE|CentroDistribucion|MAKRO MONTERIA
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|TelCentroDistribucion|N/A
PE|CorreoDist|
PE|PasaporteCliente|16-156362
PE|BarrioCliente|MONTERIA
PE|TelefonoCliente|N/A
PE|vrPuntosCMR|0.00
PE|vrEfectivo|0.00
PE|vrTdebito|1099283.00
PE|vrCheque|0.00
PE|vrChequePost|0.00
PE|vrBonos|0.00
PE|vrTcredito|0.00
PE|vrTprivada|0.00
PE|vrNotaCredito|0.00
PE|vrCreditoDirecto|0.00
PE|vrDonacion|0.00
PE|vrCambio|0.00
PE|PuntosCMR|3
PE|CorteCMR|09/02/2022
PE|Caja|1 38
PE|TotalArticulos|39
PE|TextoFecha|10-02-2022     15:32     1601 2022041128
PES|CentroDist
PESD|1|MAKRO MONTERIA
PESD|2|Cra.  14  No.  48 A 42 
PES|ResolucionesFactura
PESD|1|AGENTE RETENEDOR IVA RES.00812 30/1/2006
PESD|2|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|3|AUTORETENEDORES DEL IMPUESTO DE RENTA SEGUN RESOL No 1524 DE FEB 20 DE 2006
PES|Regimen
PESD|1|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|2| AUTORETENEDORES DEL IMPUESTO DE RENTA  
PESD|3| SEGUN RESOL No 1524 DE FEB 20 DE 2006  
PESD|4|        AGENTE RETENEDOR DE IVA         
PESD|5|      RESOLUCION 00812 30/01/2006       
PESD|6|
PESD|7|
PESD|8|
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020       CAMBIOS DENTRO DE LOS 7 DIAS HABILES A   PARTIR DE LA COMPRA,PRESENTA LA FACTURA 
PES|Falabella
PESD|1|Gracias por tu visita
PESD|2|
PESD|3|
CTE||||dte_9000592385@dte.paperless.com.co|
CTR|||||
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01</tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope> 